zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u335xx.h
/**
  * @brief RNG
  */
typedef struct
{
  __IO uint32_t CR;               /*!< RNG control register,                     Address offset: 0x00 */
  __IO uint32_t SR;               /*!< RNG status register,                      Address offset: 0x04 */
  __IO uint32_t DR;               /*!< RNG data register,                        Address offset: 0x08 */
  __IO uint32_t NSCR;             /*!< RNG noise source control register,        Address offset: 0x0C */
  __IO uint32_t HTCR[4];         /*!< RNG health test configuration register,    Address offset: 0x10-0x1C */
  __IO uint32_t HTSR[2];         /*!< RNG health test status register,           Address offset: 0x20-0x24 */
       uint32_t RESERVED1[2];    /*!< Reserved,                                  Address offset: 0x28-0x2C */
  __IO uint32_t NSMR;            /*!< RNG health test status register,           Address offset: 0x30      */
} RNG_TypeDef;

/**
  * @brief Real-Time Clock
  */
typedef struct
{
  __IO uint32_t TR;               /*!< RTC time register,                              Address offset: 0x00 */
  __IO uint32_t DR;               /*!< RTC date register,                              Address offset: 0x04 */
  __IO uint32_t SSR;              /*!< RTC sub second register,                        Address offset: 0x08 */
  __IO uint32_t ICSR;             /*!< RTC initialization control and status register, Address offset: 0x0C */
  __IO uint32_t PRER;             /*!< RTC prescaler register,                         Address offset: 0x10 */
  __IO uint32_t WUTR;             /*!< RTC wakeup timer register,                      Address offset: 0x14 */
  __IO uint32_t CR;               /*!< RTC control register,                           Address offset: 0x18 */
  __IO uint32_t PRIVCFGR;         /*!< RTC privilege mode control register,            Address offset: 0x1C */
  __IO uint32_t SECCFGR;          /*!< RTC secure mode control register,               Address offset: 0x20 */
  __IO uint32_t WPR;              /*!< RTC write protection register,                  Address offset: 0x24 */
  __IO uint32_t CALR;             /*!< RTC calibration register,                       Address offset: 0x28 */
  __IO uint32_t SHIFTR;           /*!< RTC shift control register,                     Address offset: 0x2C */
  __IO uint32_t TSTR;             /*!< RTC time stamp time register,                   Address offset: 0x30 */
  __IO uint32_t TSDR;             /*!< RTC time stamp date register,                   Address offset: 0x34 */
  __IO uint32_t TSSSR;            /*!< RTC time-stamp sub second register,             Address offset: 0x38 */
       uint32_t RESERVED0;        /*!< Reserved,                                       Address offset: 0x3C */
  __IO uint32_t ALRMAR;           /*!< RTC alarm A register,                           Address offset: 0x40 */
  __IO uint32_t ALRMASSR;         /*!< RTC alarm A sub second register,                Address offset: 0x44 */
  __IO uint32_t ALRMBR;           /*!< RTC alarm B register,                           Address offset: 0x48 */
  __IO uint32_t ALRMBSSR;         /*!< RTC alarm B sub second register,                Address offset: 0x4C */
  __IO uint32_t SR;               /*!< RTC Status register,                            Address offset: 0x50 */
  __IO uint32_t MISR;             /*!< RTC masked interrupt status register,           Address offset: 0x54 */
  __IO uint32_t SMISR;            /*!< RTC secure masked interrupt status register,    Address offset: 0x58 */
  __IO uint32_t SCR;              /*!< RTC status Clear register,                      Address offset: 0x5C */
       uint32_t RESERVED1;        /*!< Reserved,                                       Address offset: 0x60 */
  __IO uint32_t TAMPTSCR;         /*!< RTC timestamp on tamper control register,       Address offset: 0x64 */
  __IO uint32_t TSIDR;            /*!< RTC timestamp status register,                  Address offset: 0x68 */
       uint32_t RESERVED2;        /*!< Reserved,                                       Address offset: 0x6C */
  __IO uint32_t ALRABINR;         /*!< RTC alarm A binary mode register,               Address offset: 0x70 */
  __IO uint32_t ALRBBINR;         /*!< RTC alarm B binary mode register,               Address offset: 0x74 */
} RTC_TypeDef;


/**
  * @brief SPI
  */
typedef struct
{
  __IO uint32_t CR1;              /*!< SPI/I2S Control register 1,                      Address offset: 0x00 */
  __IO uint32_t CR2;               /*!< SPI Control register 2,                          Address offset: 0x04 */
  __IO uint32_t CFG1;              /*!< SPI Configuration register 1,                    Address offset: 0x08 */
  __IO uint32_t CFG2;              /*!< SPI Configuration register 2,                    Address offset: 0x0C */
  __IO uint32_t IER;               /*!< SPI Interrupt Enable register,                   Address offset: 0x10 */
  __IO uint32_t SR;                /*!< SPI Status register,                             Address offset: 0x14 */
  __IO uint32_t IFCR;              /*!< SPI Interrupt/Status Flags Clear register,       Address offset: 0x18 */
  __IO uint32_t AUTOCR;            /*!< SPI Autonomous Mode Control register,            Address offset: 0x1C */
  __IO uint32_t TXDR;              /*!< SPI Transmit data register,                      Address offset: 0x20 */
  uint32_t      RESERVED1[3];      /*!< Reserved, 0x24-0x2C                                                   */
  __IO uint32_t RXDR;              /*!< SPI/I2S data register,                           Address offset: 0x30 */
  uint32_t      RESERVED2[3];      /*!< Reserved, 0x34-0x3C                                                   */
  __IO uint32_t CRCPOLY;           /*!< SPI CRC Polynomial register,                     Address offset: 0x40 */
  __IO uint32_t TXCRC;             /*!< SPI Transmitter CRC register,                    Address offset: 0x44 */
  __IO uint32_t RXCRC;             /*!< SPI Receiver CRC register,                       Address offset: 0x48 */
  __IO uint32_t UDRDR;             /*!< SPI Underrun data register,                      Address offset: 0x4C */
} SPI_TypeDef;

/**
  * @brief System configuration controller
  */
typedef struct
{
  __IO uint32_t SECCFGR;          /*!< SYSCFG secure configuration register,            Address offset: 0x00 */
  __IO uint32_t CFGR1;            /*!< SYSCFG configuration register 1,                 Address offset: 0x04 */
  __IO uint32_t FPUIMR;           /*!< SYSCFG FPU interrupt mask register,              Address offset: 0x08 */
  __IO uint32_t CNSLCKR;          /*!< SYSCFG CPU non-secure lock register,             Address offset: 0x0C */
  __IO uint32_t CSLCKR;           /*!< SYSCFG CPU secure lock register,                 Address offset: 0x10 */
  __IO uint32_t CFGR2;            /*!< SYSCFG configuration register 2,                 Address offset: 0x14 */
       uint32_t RESERVED1;        /*!< RESERVED1,                                       Address offset: 0x28 */
  __IO uint32_t CCCSR;            /*!< SYSCFG Conpensaion Cell Control&Status register, Address offset: 0x1C */
  __IO uint32_t CCVR;             /*!< SYSCFG Conpensaion Cell value register,          Address offset: 0x20 */
  __IO uint32_t CCCR;             /*!< SYSCFG Conpensaion Cell Code register,           Address offset: 0x24 */
       uint32_t RESERVED2;        /*!< RESERVED2,                                       Address offset: 0x28 */
  __IO uint32_t RSSCMDR;          /*!< SYSCFG RSS command mode register,                Address offset: 0x2C */
} SYSCFG_TypeDef;

/**
  * @brief Tamper and backup registers
  */
typedef struct
{
  __IO uint32_t CR1;              /*!< TAMP configuration register 1,                    Address offset: 0x00 */
  __IO uint32_t CR2;              /*!< TAMP configuration register 2,                    Address offset: 0x04 */
  __IO uint32_t CR3;              /*!< TAMP configuration register 3,                    Address offset: 0x08 */
  __IO uint32_t FLTCR;            /*!< TAMP filter control register,                     Address offset: 0x0C */
       uint32_t RESERVED1[4];     /*!< Reserved,                                                 0x10 -- 0x1C */
  __IO uint32_t SECCFGR;          /*!< TAMP secure mode control register,                Address offset: 0x20 */
  __IO uint32_t PRIVCFGR;         /*!< TAMP privilege mode control register,             Address offset: 0x24 */
       uint32_t RESERVED0;        /*!< Reserved,                                         Address offset: 0x28 */
  __IO uint32_t IER;              /*!< TAMP interrupt enable register,                   Address offset: 0x2C */
  __IO uint32_t SR;               /*!< TAMP status register,                             Address offset: 0x30 */
  __IO uint32_t MISR;             /*!< TAMP masked interrupt status register,            Address offset: 0x34 */
  __IO uint32_t SMISR;            /*!< TAMP secure masked interrupt status register,     Address offset: 0x38 */
  __IO uint32_t SCR;              /*!< TAMP status clear register,                       Address offset: 0x3C */
  __IO uint32_t COUNT1R;          /*!< TAMP monotonic counter register,                  Address offset: 0x40 */
       uint32_t RESERVED2[4];     /*!< Reserved,                                                 0x44 -- 0x50 */
  __IO uint32_t RPCFGR;           /*!< TAMP resources protection configuration register, Address offset: 0x54 */
       uint32_t RESERVED3[42];    /*!< Reserved,                                                 0x58 -- 0xFC */
  __IO uint32_t BKP0R;            /*!< TAMP backup register 0,                          Address offset: 0x100 */
  __IO uint32_t BKP1R;            /*!< TAMP backup register 1,                          Address offset: 0x104 */
  __IO uint32_t BKP2R;            /*!< TAMP backup register 2,                          Address offset: 0x108 */
  __IO uint32_t BKP3R;            /*!< TAMP backup register 3,                          Address offset: 0x10C */
  __IO uint32_t BKP4R;            /*!< TAMP backup register 4,                          Address offset: 0x110 */
  __IO uint32_t BKP5R;            /*!< TAMP backup register 5,                          Address offset: 0x114 */
  __IO uint32_t BKP6R;            /*!< TAMP backup register 6,                          Address offset: 0x118 */
  __IO uint32_t BKP7R;            /*!< TAMP backup register 7,                          Address offset: 0x11C */
  __IO uint32_t BKP8R;            /*!< TAMP backup register 8,                          Address offset: 0x120 */
  __IO uint32_t BKP9R;            /*!< TAMP backup register 9,                          Address offset: 0x124 */
  __IO uint32_t BKP10R;           /*!< TAMP backup register 10,                         Address offset: 0x128 */
  __IO uint32_t BKP11R;           /*!< TAMP backup register 11,                         Address offset: 0x12C */
  __IO uint32_t BKP12R;           /*!< TAMP backup register 12,                         Address offset: 0x130 */
  __IO uint32_t BKP13R;           /*!< TAMP backup register 13,                         Address offset: 0x134 */
  __IO uint32_t BKP14R;           /*!< TAMP backup register 14,                         Address offset: 0x138 */
  __IO uint32_t BKP15R;           /*!< TAMP backup register 15,                         Address offset: 0x13C */
  __IO uint32_t BKP16R;           /*!< TAMP backup register 16,                         Address offset: 0x140 */
  __IO uint32_t BKP17R;           /*!< TAMP backup register 17,                         Address offset: 0x144 */
  __IO uint32_t BKP18R;           /*!< TAMP backup register 18,                         Address offset: 0x148 */
  __IO uint32_t BKP19R;           /*!< TAMP backup register 19,                         Address offset: 0x14C */
  __IO uint32_t BKP20R;           /*!< TAMP backup register 20,                         Address offset: 0x150 */
  __IO uint32_t BKP21R;           /*!< TAMP backup register 21,                         Address offset: 0x154 */
  __IO uint32_t BKP22R;           /*!< TAMP backup register 22,                         Address offset: 0x158 */
  __IO uint32_t BKP23R;           /*!< TAMP backup register 23,                         Address offset: 0x15C */
  __IO uint32_t BKP24R;           /*!< TAMP backup register 24,                         Address offset: 0x160 */
  __IO uint32_t BKP25R;           /*!< TAMP backup register 25,                         Address offset: 0x164 */
  __IO uint32_t BKP26R;           /*!< TAMP backup register 26,                         Address offset: 0x168 */
  __IO uint32_t BKP27R;           /*!< TAMP backup register 27,                         Address offset: 0x16C */
  __IO uint32_t BKP28R;           /*!< TAMP backup register 28,                         Address offset: 0x170 */
  __IO uint32_t BKP29R;           /*!< TAMP backup register 29,                         Address offset: 0x174 */
  __IO uint32_t BKP30R;           /*!< TAMP backup register 30,                         Address offset: 0x178 */
  __IO uint32_t BKP31R;           /*!< TAMP backup register 31,                         Address offset: 0x17C */
} TAMP_TypeDef;

/**
  * @brief Touch Sensing Controller (TSC)
  */
typedef struct
{
  __IO uint32_t CR;               /*!< TSC control register,                           Address offset: 0x00 */
  __IO uint32_t IER;              /*!< TSC interrupt enable register,                  Address offset: 0x04 */
  __IO uint32_t ICR;              /*!< TSC interrupt clear register,                   Address offset: 0x08 */
  __IO uint32_t ISR;              /*!< TSC interrupt status register,                  Address offset: 0x0C */
  __IO uint32_t IOHCR;            /*!< TSC I/O hysteresis control register,            Address offset: 0x10 */
  uint32_t      RESERVED1;        /*!< Reserved,                                       Address offset: 0x14 */
  __IO uint32_t IOASCR;           /*!< TSC I/O analog switch control register,         Address offset: 0x18 */
  uint32_t      RESERVED2;        /*!< Reserved,                                       Address offset: 0x1C */
  __IO uint32_t IOSCR;            /*!< TSC I/O sampling control register,              Address offset: 0x20 */
  uint32_t      RESERVED3;        /*!< Reserved,                                       Address offset: 0x24 */
  __IO uint32_t IOCCR;            /*!< TSC I/O channel control register,               Address offset: 0x28 */
  uint32_t      RESERVED4;        /*!< Reserved,                                       Address offset: 0x2C */
  __IO uint32_t IOGCSR;           /*!< TSC I/O group control status register,          Address offset: 0x30 */
  __IO uint32_t IOGXCR[7];        /*!< TSC I/O group x counter register,                          0x34-0x4C */
} TSC_TypeDef;

/**
  * @brief TIM
  */
typedef struct
{
  __IO uint32_t CR1;              /*!< TIM control register 1,                   Address offset: 0x00 */
  __IO uint32_t CR2;              /*!< TIM control register 2,                   Address offset: 0x04 */
  __IO uint32_t SMCR;             /*!< TIM slave mode control register,          Address offset: 0x08 */
  __IO uint32_t DIER;             /*!< TIM DMA/interrupt enable register,        Address offset: 0x0C */
  __IO uint32_t SR;               /*!< TIM status register,                      Address offset: 0x10 */
  __IO uint32_t EGR;              /*!< TIM event generation register,            Address offset: 0x14 */
  __IO uint32_t CCMR1;            /*!< TIM capture/compare mode register 1,      Address offset: 0x18 */
  __IO uint32_t CCMR2;            /*!< TIM capture/compare mode register 2,      Address offset: 0x1C */
  __IO uint32_t CCER;             /*!< TIM capture/compare enable register,      Address offset: 0x20 */
  __IO uint32_t CNT;              /*!< TIM counter register,                     Address offset: 0x24 */
  __IO uint32_t PSC;              /*!< TIM prescaler,                            Address offset: 0x28 */
  __IO uint32_t ARR;              /*!< TIM auto-reload register,                 Address offset: 0x2C */
  __IO uint32_t RCR;              /*!< TIM repetition counter register,          Address offset: 0x30 */
  __IO uint32_t CCR1;             /*!< TIM capture/compare register 1,           Address offset: 0x34 */
  __IO uint32_t CCR2;             /*!< TIM capture/compare register 2,           Address offset: 0x38 */
  __IO uint32_t CCR3;             /*!< TIM capture/compare register 3,           Address offset: 0x3C */
  __IO uint32_t CCR4;             /*!< TIM capture/compare register 4,           Address offset: 0x40 */
  __IO uint32_t BDTR;             /*!< TIM break and dead-time register,         Address offset: 0x44 */
  __IO uint32_t CCR5;             /*!< TIM capture/compare register 5,           Address offset: 0x48 */
  __IO uint32_t CCR6;             /*!< TIM capture/compare register 6,           Address offset: 0x4C */
  __IO uint32_t CCMR3;            /*!< TIM capture/compare mode register 3,      Address offset: 0x50 */
  __IO uint32_t DTR2;             /*!< TIM deadtime register 2,                  Address offset: 0x54 */
  __IO uint32_t ECR;              /*!< TIM encoder control register,             Address offset: 0x58 */
  __IO uint32_t TISEL;            /*!< TIM Input Selection register,             Address offset: 0x5C */
  __IO uint32_t AF1;              /*!< TIM alternate function option register 1, Address offset: 0x60 */
  __IO uint32_t AF2;              /*!< TIM alternate function option register 2, Address offset: 0x64 */
  __IO uint32_t OR1 ;             /*!< TIM option register,                      Address offset: 0x68 */
       uint32_t RESERVED0[220];     /*!< Reserved,                               Address offset: 0x6C */
  __IO uint32_t DCR;              /*!< TIM DMA control register,                Address offset: 0x3DC */
  __IO uint32_t DMAR;             /*!< TIM DMA address for full transfer,       Address offset: 0x3E0 */
} TIM_TypeDef;

/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */
typedef struct
{
  __IO uint32_t CR1;              /*!< USART Control register 1,                 Address offset: 0x00  */
  __IO uint32_t CR2;              /*!< USART Control register 2,                 Address offset: 0x04  */
  __IO uint32_t CR3;              /*!< USART Control register 3,                 Address offset: 0x08  */
  __IO uint32_t BRR;              /*!< USART Baud rate register,                 Address offset: 0x0C  */
  __IO uint32_t GTPR;             /*!< USART Guard time and prescaler register,  Address offset: 0x10  */
  __IO uint32_t RTOR;             /*!< USART Receiver Time Out register,         Address offset: 0x14  */
  __IO uint32_t RQR;              /*!< USART Request register,                   Address offset: 0x18  */
  __IO uint32_t ISR;              /*!< USART Interrupt and status register,      Address offset: 0x1C  */
  __IO uint32_t ICR;              /*!< USART Interrupt flag Clear register,      Address offset: 0x20  */
  __IO uint32_t RDR;              /*!< USART Receive Data register,              Address offset: 0x24  */
  __IO uint32_t TDR;              /*!< USART Transmit Data register,             Address offset: 0x28  */
  __IO uint32_t PRESC;            /*!< USART Prescaler register,                 Address offset: 0x2C  */
  __IO uint32_t AUTOCR;           /*!< USART Autonomous mode control register    Address offset: 0x30  */
} USART_TypeDef;

/**
  * @brief Universal Serial Bus Full Speed Dual Role Device
  */
typedef struct
{
  __IO uint32_t CHEP0R;          /*!< USB Channel/Endpoint 0 register,      Address offset: 0x00 */
  __IO uint32_t CHEP1R;          /*!< USB Channel/Endpoint 1 register,      Address offset: 0x04 */
  __IO uint32_t CHEP2R;          /*!< USB Channel/Endpoint 2 register,      Address offset: 0x08 */
  __IO uint32_t CHEP3R;          /*!< USB Channel/Endpoint 3 register,      Address offset: 0x0C */
  __IO uint32_t CHEP4R;          /*!< USB Channel/Endpoint 4 register,      Address offset: 0x10 */
  __IO uint32_t CHEP5R;          /*!< USB Channel/Endpoint 5 register,      Address offset: 0x14 */
  __IO uint32_t CHEP6R;          /*!< USB Channel/Endpoint 6 register,      Address offset: 0x18 */
  __IO uint32_t CHEP7R;          /*!< USB Channel/Endpoint 7 register,      Address offset: 0x1C */
  __IO uint32_t RESERVED0[8];    /*!< Reserved,                                                  */
  __IO uint32_t CNTR;            /*!< Control register,                     Address offset: 0x40 */
  __IO uint32_t ISTR;            /*!< Interrupt status register,            Address offset: 0x44 */
  __IO uint32_t FNR;             /*!< Frame number register,                Address offset: 0x48 */
  __IO uint32_t DADDR;           /*!< Device address register,              Address offset: 0x4C */
  __IO uint32_t RESERVED1;       /*!< Reserved */
  __IO uint32_t LPMCSR;          /*!< LPM Control and Status register,      Address offset: 0x54 */
  __IO uint32_t BCDR;            /*!< Battery Charging detector register,   Address offset: 0x58 */
} USB_DRD_TypeDef;

/**
  * @brief Universal Serial Bus PacketMemoryArea Buffer Descriptor Table
  */
typedef struct
{
  __IO uint32_t TXBD;             /*!<Transmission buffer address*/
  __IO uint32_t RXBD;             /*!<Reception buffer address */
} USB_DRD_PMABuffDescTypeDef;


/**
  * @brief WWDG
  */
typedef struct
{
  __IO uint32_t CR;               /*!< WWDG Control register,       Address offset: 0x00 */
  __IO uint32_t CFR;              /*!< WWDG Configuration register, Address offset: 0x04 */
  __IO uint32_t SR;               /*!< WWDG Status register,        Address offset: 0x08 */
} WWDG_TypeDef;

