zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u335xx.h
/******************  Bits definition for FLASH_KEYR register  *****************/
#define FLASH_KEYR_KEY_Pos                  (0UL)
#define FLASH_KEYR_KEY_Msk                  (0xFFFFFFFFUL << FLASH_KEYR_KEY_Pos)    /*!< 0xFFFFFFFFF */
#define FLASH_KEYR_KEY                      FLASH_KEYR_KEY_Msk                      /*!< Flash non-secure key */

/*****************  Bits definition for FLASH_SKEYR register  *****************/
#define FLASH_SKEYR_KEY_Pos                 (0UL)
#define FLASH_SKEYR_KEY_Msk                 (0xFFFFFFFFUL << FLASH_SKEYR_KEY_Pos)   /*!< 0xFFFFFFFFF */
#define FLASH_SKEYR_KEY                     FLASH_SKEYR_KEY_Msk                     /*!< Flash secure key */

/****************  Bits definition for FLASH_OPTKEYR register  ****************/
#define FLASH_OPTKEYR_KEY_Pos               (0UL)
#define FLASH_OPTKEYR_KEY_Msk               (0xFFFFFFFFUL << FLASH_OPTKEYR_KEY_Pos) /*!< 0xFFFFFFFFF */
#define FLASH_OPTKEYR_KEY                   FLASH_OPTKEYR_KEY_Msk                   /*!< Option byte key */

/****************  Bits definition for FLASH_PDKEY1R register  ****************/
#define FLASH_PDKEY1R_KEY1_Pos              (0UL)
#define FLASH_PDKEY1R_KEY1_Msk              (0xFFFFFFFFUL << FLASH_PDKEY1R_KEY1_Pos) /*!< 0xFFFFFFFFF */
#define FLASH_PDKEY1R_KEY1                  FLASH_PDKEY1R_KEY1_Msk                   /*!< Bank 1 power-down key */

/****************  Bits definition for FLASH_PDKEY2R register  ****************/
#define FLASH_PDKEY2R_KEY2_Pos              (0UL)
#define FLASH_PDKEY2R_KEY2_Msk              (0xFFFFFFFFUL << FLASH_PDKEY2R_KEY2_Pos) /*!< 0xFFFFFFFFF */
#define FLASH_PDKEY2R_KEY2                  FLASH_PDKEY2R_KEY2_Msk                   /*!< Bank 2 power-down key */

/*******************  Bits definition for FLASH_SR register  ******************/
#define FLASH_SR_EOP_Pos                    (0UL)
#define FLASH_SR_EOP_Msk                    (0x1UL << FLASH_SR_EOP_Pos)             /*!< 0x00000001 */
#define FLASH_SR_EOP                        FLASH_SR_EOP_Msk                        /*!< Non-secure end of operation */
#define FLASH_SR_OPERR_Pos                  (1UL)
#define FLASH_SR_OPERR_Msk                  (0x1UL << FLASH_SR_OPERR_Pos)           /*!< 0x00000002 */
#define FLASH_SR_OPERR                      FLASH_SR_OPERR_Msk                      /*!< Non-secure operation error */
#define FLASH_SR_PROGERR_Pos                (3UL)
#define FLASH_SR_PROGERR_Msk                (0x1UL << FLASH_SR_PROGERR_Pos)         /*!< 0x00000008 */
#define FLASH_SR_PROGERR                    FLASH_SR_PROGERR_Msk                    /*!< Non-secure programming error */
#define FLASH_SR_WRPERR_Pos                 (4UL)
#define FLASH_SR_WRPERR_Msk                 (0x1UL << FLASH_SR_WRPERR_Pos)          /*!< 0x00000010 */
#define FLASH_SR_WRPERR                     FLASH_SR_WRPERR_Msk                     /*!< Non-secure write protection error */
#define FLASH_SR_PGAERR_Pos                 (5UL)
#define FLASH_SR_PGAERR_Msk                 (0x1UL << FLASH_SR_PGAERR_Pos)          /*!< 0x00000020 */
#define FLASH_SR_PGAERR                     FLASH_SR_PGAERR_Msk                     /*!< Non-secure programming alignment error */
#define FLASH_SR_SIZERR_Pos                 (6UL)
#define FLASH_SR_SIZERR_Msk                 (0x1UL << FLASH_SR_SIZERR_Pos)          /*!< 0x00000040 */
#define FLASH_SR_SIZERR                     FLASH_SR_SIZERR_Msk                     /*!< Non-secure size error */
#define FLASH_SR_PGSERR_Pos                 (7UL)
#define FLASH_SR_PGSERR_Msk                 (0x1UL << FLASH_SR_PGSERR_Pos)          /*!< 0x00000080 */
#define FLASH_SR_PGSERR                     FLASH_SR_PGSERR_Msk                     /*!< Non-secure programming sequence error */
#define FLASH_SR_OPTWERR_Pos                (13UL)
#define FLASH_SR_OPTWERR_Msk                (0x1UL << FLASH_SR_OPTWERR_Pos)         /*!< 0x00002000 */
#define FLASH_SR_OPTWERR                    FLASH_SR_OPTWERR_Msk                    /*!< Option write error */
#define FLASH_SR_BSY_Pos                    (16UL)
#define FLASH_SR_BSY_Msk                    (0x1UL << FLASH_SR_BSY_Pos)             /*!< 0x00010000 */
#define FLASH_SR_BSY                        FLASH_SR_BSY_Msk                        /*!< Non-secure busy */
#define FLASH_SR_WDW_Pos                    (17UL)
#define FLASH_SR_WDW_Msk                    (0x1UL << FLASH_SR_WDW_Pos)             /*!< 0x00020000 */
#define FLASH_SR_WDW                        FLASH_SR_WDW_Msk                        /*!< Non-secure wait data to write */
#define FLASH_SR_OEM1LOCK_Pos               (18UL)
#define FLASH_SR_OEM1LOCK_Msk               (0x1UL << FLASH_SR_OEM1LOCK_Pos)        /*!< 0x00040000 */
#define FLASH_SR_OEM1LOCK                   FLASH_SR_OEM1LOCK_Msk                   /*!< OEM1 lock */
#define FLASH_SR_OEM2LOCK_Pos               (19UL)
#define FLASH_SR_OEM2LOCK_Msk               (0x1UL << FLASH_SR_OEM2LOCK_Pos)        /*!< 0x00080000 */
#define FLASH_SR_OEM2LOCK                   FLASH_SR_OEM2LOCK_Msk                   /*!< OEM2 lock */
#define FLASH_SR_PD1_Pos                    (20UL)
#define FLASH_SR_PD1_Msk                    (0x1UL << FLASH_SR_PD1_Pos)             /*!< 0x00100000 */
#define FLASH_SR_PD1                        FLASH_SR_PD1_Msk                        /*!< Bank 1 in power-down mode */
#define FLASH_SR_PD2_Pos                    (21UL)
#define FLASH_SR_PD2_Msk                    (0x1UL << FLASH_SR_PD2_Pos)             /*!< 0x00200000 */
#define FLASH_SR_PD2                        FLASH_SR_PD2_Msk                        /*!< Bank 2 in power-down mode */

/*******************  Bits definition for FLASH_SSR register  *****************/
#define FLASH_SSR_EOP_Pos                   (0UL)
#define FLASH_SSR_EOP_Msk                   (0x1UL << FLASH_SSR_EOP_Pos)            /*!< 0x00000001 */
#define FLASH_SSR_EOP                       FLASH_SSR_EOP_Msk                       /*!< Secure end of operation */
#define FLASH_SSR_OPERR_Pos                 (1UL)
#define FLASH_SSR_OPERR_Msk                 (0x1UL << FLASH_SSR_OPERR_Pos)          /*!< 0x00000002 */
#define FLASH_SSR_OPERR                     FLASH_SSR_OPERR_Msk                     /*!< Secure operation error */
#define FLASH_SSR_PROGERR_Pos               (3UL)
#define FLASH_SSR_PROGERR_Msk               (0x1UL << FLASH_SSR_PROGERR_Pos)        /*!< 0x00000008 */
#define FLASH_SSR_PROGERR                   FLASH_SSR_PROGERR_Msk                   /*!< Secure programming error */
#define FLASH_SSR_WRPERR_Pos                (4UL)
#define FLASH_SSR_WRPERR_Msk                (0x1UL << FLASH_SSR_WRPERR_Pos)         /*!< 0x00000010 */
#define FLASH_SSR_WRPERR                    FLASH_SSR_WRPERR_Msk                    /*!< Secure write protection error */
#define FLASH_SSR_PGAERR_Pos                (5UL)
#define FLASH_SSR_PGAERR_Msk                (0x1UL << FLASH_SSR_PGAERR_Pos)         /*!< 0x00000020 */
#define FLASH_SSR_PGAERR                    FLASH_SSR_PGAERR_Msk                    /*!< Secure programming alignment error */
#define FLASH_SSR_SIZERR_Pos                (6UL)
#define FLASH_SSR_SIZERR_Msk                (0x1UL << FLASH_SSR_SIZERR_Pos)         /*!< 0x00000040 */
#define FLASH_SSR_SIZERR                    FLASH_SSR_SIZERR_Msk                    /*!< Secure size error */
#define FLASH_SSR_PGSERR_Pos                (7UL)
#define FLASH_SSR_PGSERR_Msk                (0x1UL << FLASH_SSR_PGSERR_Pos)         /*!< 0x00000080 */
#define FLASH_SSR_PGSERR                    FLASH_SSR_PGSERR_Msk                    /*!< Secure programming sequence error */
#define FLASH_SSR_BSY_Pos                   (16UL)
#define FLASH_SSR_BSY_Msk                   (0x1UL << FLASH_SSR_BSY_Pos)            /*!< 0x00010000 */
#define FLASH_SSR_BSY                       FLASH_SSR_BSY_Msk                       /*!< Secure busy */
#define FLASH_SSR_WDW_Pos                   (17UL)
#define FLASH_SSR_WDW_Msk                   (0x1UL << FLASH_SSR_WDW_Pos)            /*!< 0x00020000 */
#define FLASH_SSR_WDW                       FLASH_SSR_WDW_Msk                       /*!< Secure wait data to write */

