zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u335xx.h
/********************  Bit definition for RCC_AHB2SLPENR2 register  **************/
#define RCC_AHB2SLPENR2_OCTOSPI1SLPEN_Pos   (4UL)
#define RCC_AHB2SLPENR2_OCTOSPI1SLPEN_Msk   (0x1UL << RCC_AHB2SLPENR2_OCTOSPI1SLPEN_Pos)  /*!< 0x00000010 */
#define RCC_AHB2SLPENR2_OCTOSPI1SLPEN       RCC_AHB2SLPENR2_OCTOSPI1SLPEN_Msk             /*!< OCTOSPI1 Sleep Mode Enable */

/********************  Bit definition for RCC_AHB1SLPENR2 register  **************/
#define RCC_AHB1SLPENR2_PWRSLPEN_Pos        (2UL)
#define RCC_AHB1SLPENR2_PWRSLPEN_Msk        (0x1UL << RCC_AHB1SLPENR2_PWRSLPEN_Pos)       /*!< 0x00000004 */
#define RCC_AHB1SLPENR2_PWRSLPEN            RCC_AHB1SLPENR2_PWRSLPEN_Msk                  /*!< PWR Sleep Mode Enable */

/********************  Bit definition for RCC_APB1SLPENR1 register  **************/
#define RCC_APB1SLPENR1_TIM2SLPEN_Pos       (0UL)
#define RCC_APB1SLPENR1_TIM2SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_TIM2SLPEN_Pos)      /*!< 0x00000001 */
#define RCC_APB1SLPENR1_TIM2SLPEN           RCC_APB1SLPENR1_TIM2SLPEN_Msk                 /*!< TIM2 Sleep Mode Enable */
#define RCC_APB1SLPENR1_TIM3SLPEN_Pos       (1UL)
#define RCC_APB1SLPENR1_TIM3SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_TIM3SLPEN_Pos)      /*!< 0x00000002 */
#define RCC_APB1SLPENR1_TIM3SLPEN           RCC_APB1SLPENR1_TIM3SLPEN_Msk                 /*!< TIM3 Sleep Mode Enable */
#define RCC_APB1SLPENR1_TIM4SLPEN_Pos       (2UL)
#define RCC_APB1SLPENR1_TIM4SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_TIM4SLPEN_Pos)      /*!< 0x00000004 */
#define RCC_APB1SLPENR1_TIM4SLPEN           RCC_APB1SLPENR1_TIM4SLPEN_Msk                 /*!< TIM4 Sleep Mode Enable */
#define RCC_APB1SLPENR1_TIM6SLPEN_Pos       (4UL)
#define RCC_APB1SLPENR1_TIM6SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_TIM6SLPEN_Pos)      /*!< 0x00000010 */
#define RCC_APB1SLPENR1_TIM6SLPEN           RCC_APB1SLPENR1_TIM6SLPEN_Msk                 /*!< TIM6 Sleep Mode Enable */
#define RCC_APB1SLPENR1_TIM7SLPEN_Pos       (5UL)
#define RCC_APB1SLPENR1_TIM7SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_TIM7SLPEN_Pos)      /*!< 0x00000020 */
#define RCC_APB1SLPENR1_TIM7SLPEN           RCC_APB1SLPENR1_TIM7SLPEN_Msk                 /*!< TIM7 Sleep Mode Enable */
#define RCC_APB1SLPENR1_WWDGSLPEN_Pos       (11UL)
#define RCC_APB1SLPENR1_WWDGSLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_WWDGSLPEN_Pos)      /*!< 0x00000800 */
#define RCC_APB1SLPENR1_WWDGSLPEN           RCC_APB1SLPENR1_WWDGSLPEN_Msk                 /*!< WWDG Sleep Mode Enable */
#define RCC_APB1SLPENR1_SPI2SLPEN_Pos       (14UL)
#define RCC_APB1SLPENR1_SPI2SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_SPI2SLPEN_Pos)      /*!< 0x00004000 */
#define RCC_APB1SLPENR1_SPI2SLPEN           RCC_APB1SLPENR1_SPI2SLPEN_Msk                 /*!< SPI2 Sleep Mode Enable */
#define RCC_APB1SLPENR1_USART3SLPEN_Pos     (18UL)
#define RCC_APB1SLPENR1_USART3SLPEN_Msk     (0x1UL << RCC_APB1SLPENR1_USART3SLPEN_Pos)    /*!< 0x00040000 */
#define RCC_APB1SLPENR1_USART3SLPEN         RCC_APB1SLPENR1_USART3SLPEN_Msk               /*!< USART3 Sleep Mode Enable */
#define RCC_APB1SLPENR1_UART4SLPEN_Pos      (19UL)
#define RCC_APB1SLPENR1_UART4SLPEN_Msk      (0x1UL << RCC_APB1SLPENR1_UART4SLPEN_Pos)     /*!< 0x00080000 */
#define RCC_APB1SLPENR1_UART4SLPEN          RCC_APB1SLPENR1_UART4SLPEN_Msk                /*!< UART4 Sleep Mode Enable */
#define RCC_APB1SLPENR1_I2C1SLPEN_Pos       (21UL)
#define RCC_APB1SLPENR1_I2C1SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_I2C1SLPEN_Pos)      /*!< 0x00200000 */
#define RCC_APB1SLPENR1_I2C1SLPEN           RCC_APB1SLPENR1_I2C1SLPEN_Msk                 /*!< I2C1 Sleep Mode Enable */
#define RCC_APB1SLPENR1_I3C1SLPEN_Pos       (23UL)
#define RCC_APB1SLPENR1_I3C1SLPEN_Msk       (0x1UL << RCC_APB1SLPENR1_I3C1SLPEN_Pos)      /*!< 0x00800000 */
#define RCC_APB1SLPENR1_I3C1SLPEN           RCC_APB1SLPENR1_I3C1SLPEN_Msk                 /*!< I3C1 Sleep Mode Enable  */
#define RCC_APB1SLPENR1_CRSSLPEN_Pos        (24UL)
#define RCC_APB1SLPENR1_CRSSLPEN_Msk        (0x1UL << RCC_APB1SLPENR1_CRSSLPEN_Pos)       /*!< 0x01000000 */
#define RCC_APB1SLPENR1_CRSSLPEN            RCC_APB1SLPENR1_CRSSLPEN_Msk                  /*!< CRS Sleep Mode Enable */
#define RCC_APB1SLPENR1_OPAMPSLPEN_Pos      (28UL)
#define RCC_APB1SLPENR1_OPAMPSLPEN_Msk      (0x1UL << RCC_APB1SLPENR1_OPAMPSLPEN_Pos)     /*!< 0x100000000 */
#define RCC_APB1SLPENR1_OPAMPSLPEN          RCC_APB1SLPENR1_OPAMPSLPEN_Msk                /*!< OPAMP Sleep Mode Enable */
#define RCC_APB1SLPENR1_RTCAPBSLPEN_Pos     (30UL)
#define RCC_APB1SLPENR1_RTCAPBSLPEN_Msk     (0x1UL << RCC_APB1SLPENR1_RTCAPBSLPEN_Pos)    /*!< 0x400000000 */
#define RCC_APB1SLPENR1_RTCAPBSLPEN         RCC_APB1SLPENR1_RTCAPBSLPEN_Msk               /*!< RTCAPB Sleep Mode Enable */

/********************  Bit definition for RCC_APB1SLPENR2 register  **************/
#define RCC_APB1SLPENR2_LPTIM2SLPEN_Pos     (5UL)
#define RCC_APB1SLPENR2_LPTIM2SLPEN_Msk     (0x1UL << RCC_APB1SLPENR2_LPTIM2SLPEN_Pos)    /*!< 0x00000020 */
#define RCC_APB1SLPENR2_LPTIM2SLPEN         RCC_APB1SLPENR2_LPTIM2SLPEN_Msk               /*!< LPTIM2 Sleep Mode Enable */
#define RCC_APB1SLPENR2_FDCANSLPEN_Pos      (9UL)
#define RCC_APB1SLPENR2_FDCANSLPEN_Msk      (0x1UL << RCC_APB1SLPENR2_FDCANSLPEN_Pos)    /*!< 0x00000200 */
#define RCC_APB1SLPENR2_FDCANSLPEN          RCC_APB1SLPENR2_FDCANSLPEN_Msk               /*!< FDCAN1 Sleep Mode Enable */
#define RCC_APB1SLPENR2_FDCAN1SLPEN_Pos     RCC_APB1SLPENR2_FDCANSLPEN_Pos
#define RCC_APB1SLPENR2_FDCAN1SLPEN_Msk     RCC_APB1SLPENR2_FDCANSLPEN_Msk
#define RCC_APB1SLPENR2_FDCAN1SLPEN         RCC_APB1SLPENR2_FDCANSLPEN

/********************  Bit definition for RCC_APB2SLPENR register  **************/
#define RCC_APB2SLPENR_TIM1SLPEN_Pos        (11UL)
#define RCC_APB2SLPENR_TIM1SLPEN_Msk        (0x1UL << RCC_APB2SLPENR_TIM1SLPEN_Pos)       /*!< 0x00000800 */
#define RCC_APB2SLPENR_TIM1SLPEN            RCC_APB2SLPENR_TIM1SLPEN_Msk                  /*!< TIM1 Sleep Mode Enable */
#define RCC_APB2SLPENR_SPI1SLPEN_Pos        (12UL)
#define RCC_APB2SLPENR_SPI1SLPEN_Msk        (0x1UL << RCC_APB2SLPENR_SPI1SLPEN_Pos)       /*!< 0x00001000 */
#define RCC_APB2SLPENR_SPI1SLPEN            RCC_APB2SLPENR_SPI1SLPEN_Msk                  /*!< SPI1 Sleep Mode Enable */
#define RCC_APB2SLPENR_USART1SLPEN_Pos      (14UL)
#define RCC_APB2SLPENR_USART1SLPEN_Msk      (0x1UL << RCC_APB2SLPENR_USART1SLPEN_Pos)     /*!< 0x00004000 */
#define RCC_APB2SLPENR_USART1SLPEN          RCC_APB2SLPENR_USART1SLPEN_Msk                /*!< USART1 Sleep Mode Enable */
#define RCC_APB2SLPENR_TIM15SLPEN_Pos       (16UL)
#define RCC_APB2SLPENR_TIM15SLPEN_Msk       (0x1UL << RCC_APB2SLPENR_TIM15SLPEN_Pos)      /*!< 0x00010000 */
#define RCC_APB2SLPENR_TIM15SLPEN           RCC_APB2SLPENR_TIM15SLPEN_Msk                 /*!< TIM15 Sleep Mode Enable */
#define RCC_APB2SLPENR_TIM16SLPEN_Pos       (17UL)
#define RCC_APB2SLPENR_TIM16SLPEN_Msk       (0x1UL << RCC_APB2SLPENR_TIM16SLPEN_Pos)      /*!< 0x00020000 */
#define RCC_APB2SLPENR_TIM16SLPEN           RCC_APB2SLPENR_TIM16SLPEN_Msk                 /*!< TIM16 Sleep Mode Enable */
#define RCC_APB2SLPENR_TIM17SLPEN_Pos       (18UL)
#define RCC_APB2SLPENR_TIM17SLPEN_Msk       (0x1UL << RCC_APB2SLPENR_TIM17SLPEN_Pos)      /*!< 0x00040000 */
#define RCC_APB2SLPENR_TIM17SLPEN           RCC_APB2SLPENR_TIM17SLPEN_Msk                 /*!< TIM17 Sleep Mode Enable */
#define RCC_APB2SLPENR_USB1SLPEN_Pos        (24UL)
#define RCC_APB2SLPENR_USB1SLPEN_Msk        (0x1UL << RCC_APB2SLPENR_USB1SLPEN_Pos)       /*!< 0x01000000 */
#define RCC_APB2SLPENR_USB1SLPEN            RCC_APB2SLPENR_USB1SLPEN_Msk                  /*!< USB1 Sleep Mode Enable */

/********************  Bit definition for RCC_APB3SLPENR register  **************/
#define RCC_APB3SLPENR_SYSCFGSLPEN_Pos      (1UL)
#define RCC_APB3SLPENR_SYSCFGSLPEN_Msk      (0x1UL << RCC_APB3SLPENR_SYSCFGSLPEN_Pos)     /*!< 0x00000002 */
#define RCC_APB3SLPENR_SYSCFGSLPEN          RCC_APB3SLPENR_SYSCFGSLPEN_Msk                /*!< SYSCFG Sleep Mode Enable */
#define RCC_APB3SLPENR_LPUART1SLPEN_Pos     (6UL)
#define RCC_APB3SLPENR_LPUART1SLPEN_Msk     (0x1UL << RCC_APB3SLPENR_LPUART1SLPEN_Pos)    /*!< 0x00000040 */
#define RCC_APB3SLPENR_LPUART1SLPEN         RCC_APB3SLPENR_LPUART1SLPEN_Msk               /*!< LPUART1 Sleep Mode Enable */
#define RCC_APB3SLPENR_I2C3SLPEN_Pos        (7UL)
#define RCC_APB3SLPENR_I2C3SLPEN_Msk        (0x1UL << RCC_APB3SLPENR_I2C3SLPEN_Pos)       /*!< 0x00000080 */
#define RCC_APB3SLPENR_I2C3SLPEN            RCC_APB3SLPENR_I2C3SLPEN_Msk                  /*!< I2C3 Sleep Mode Enable */
#define RCC_APB3SLPENR_LPTIM1SLPEN_Pos      (11UL)
#define RCC_APB3SLPENR_LPTIM1SLPEN_Msk      (0x1UL << RCC_APB3SLPENR_LPTIM1SLPEN_Pos)     /*!< 0x00000800 */
#define RCC_APB3SLPENR_LPTIM1SLPEN          RCC_APB3SLPENR_LPTIM1SLPEN_Msk                /*!< LPTIM1 Sleep Mode Enable */
#define RCC_APB3SLPENR_LPTIM3SLPEN_Pos      (12UL)
#define RCC_APB3SLPENR_LPTIM3SLPEN_Msk      (0x1UL << RCC_APB3SLPENR_LPTIM3SLPEN_Pos)     /*!< 0x00001000 */
#define RCC_APB3SLPENR_LPTIM3SLPEN          RCC_APB3SLPENR_LPTIM3SLPEN_Msk                /*!< LPTIM3 Sleep Mode Enable */
#define RCC_APB3SLPENR_LPTIM4SLPEN_Pos      (13UL)
#define RCC_APB3SLPENR_LPTIM4SLPEN_Msk      (0x1UL << RCC_APB3SLPENR_LPTIM4SLPEN_Pos)     /*!< 0x00002000 */
#define RCC_APB3SLPENR_LPTIM4SLPEN          RCC_APB3SLPENR_LPTIM4SLPEN_Msk                /*!< LPTIM4 Sleep Mode Enable */
#define RCC_APB3SLPENR_COMPSLPEN_Pos        (15UL)
#define RCC_APB3SLPENR_COMPSLPEN_Msk        (0x1UL << RCC_APB3SLPENR_COMPSLPEN_Pos)       /*!< 0x00008000 */
#define RCC_APB3SLPENR_COMPSLPEN            RCC_APB3SLPENR_COMPSLPEN_Msk                  /*!< COMP Sleep Mode Enable */

/********************  Bit definition for RCC_AHB1STPENR register  **************/
#define RCC_AHB1STPENR1_GPDMA1STPEN_Pos     (0UL)
#define RCC_AHB1STPENR1_GPDMA1STPEN_Msk     (0x1UL << RCC_AHB1STPENR1_GPDMA1STPEN_Pos)     /*!< 0x00000001 */
#define RCC_AHB1STPENR1_GPDMA1STPEN         RCC_AHB1STPENR1_GPDMA1STPEN_Msk                /*!< GPDMA1 Clock Enable in Stop Mode */
#define RCC_AHB1STPENR1_ADF1STPEN_Pos       (3UL)
#define RCC_AHB1STPENR1_ADF1STPEN_Msk       (0x1UL << RCC_AHB1STPENR1_ADF1STPEN_Pos)       /*!< 0x00000008 */
#define RCC_AHB1STPENR1_ADF1STPEN           RCC_AHB1STPENR1_ADF1STPEN_Msk                  /*!< ADF1 Clock Enable in Stop Mode */
#define RCC_AHB1STPENR1_FLASHSTPEN_Pos      (8UL)
#define RCC_AHB1STPENR1_FLASHSTPEN_Msk      (0x1UL << RCC_AHB1STPENR1_FLASHSTPEN_Pos)      /*!< 0x00000100 */
#define RCC_AHB1STPENR1_FLASHSTPEN          RCC_AHB1STPENR1_FLASHSTPEN_Msk                 /*!< FLASH Clock Enable in Stop Mode */
#define RCC_AHB1STPENR1_RAMCFGSTPEN_Pos     (17UL)
#define RCC_AHB1STPENR1_RAMCFGSTPEN_Msk     (0x1UL << RCC_AHB1STPENR1_RAMCFGSTPEN_Pos)     /*!< 0x00020000 */
#define RCC_AHB1STPENR1_RAMCFGSTPEN         RCC_AHB1STPENR1_RAMCFGSTPEN_Msk                /*!< RAMCFG Clock Enable in Stop Mode */
#define RCC_AHB1STPENR1_GTZC1STPEN_Pos      (24UL)
#define RCC_AHB1STPENR1_GTZC1STPEN_Msk      (0x1UL << RCC_AHB1STPENR1_GTZC1STPEN_Pos)      /*!< 0x00100000 */
#define RCC_AHB1STPENR1_GTZC1STPEN          RCC_AHB1STPENR1_GTZC1STPEN_Msk                 /*!< GTZC1 Clock Enable in Stop Mode */
#define RCC_AHB1STPENR1_SRAM1STPEN_Pos      (31UL)
#define RCC_AHB1STPENR1_SRAM1STPEN_Msk      (0x1UL << RCC_AHB1STPENR1_SRAM1STPEN_Pos)      /*!< 0x80000000 */
#define RCC_AHB1STPENR1_SRAM1STPEN          RCC_AHB1STPENR1_SRAM1STPEN_Msk                 /*!< SRAM1 Clock Enable in Stop Mode */

/********************  Bit definition for RCC_AHB2STPENR1 register  **************/
#define RCC_AHB2STPENR1_GPIOASTPEN_Pos      (0UL)
#define RCC_AHB2STPENR1_GPIOASTPEN_Msk      (0x1UL << RCC_AHB2STPENR1_GPIOASTPEN_Pos)     /*!< 0x00000001 */
#define RCC_AHB2STPENR1_GPIOASTPEN          RCC_AHB2STPENR1_GPIOASTPEN_Msk                /*!< IO port A Clock Enable in Stop Mode */
#define RCC_AHB2STPENR1_GPIOBSTPEN_Pos      (1UL)
#define RCC_AHB2STPENR1_GPIOBSTPEN_Msk      (0x1UL << RCC_AHB2STPENR1_GPIOBSTPEN_Pos)     /*!< 0x00000002 */
#define RCC_AHB2STPENR1_GPIOBSTPEN          RCC_AHB2STPENR1_GPIOBSTPEN_Msk                /*!< IO port B Clock Enable in Stop Mode */
#define RCC_AHB2STPENR1_GPIOCSTPEN_Pos      (2UL)
#define RCC_AHB2STPENR1_GPIOCSTPEN_Msk      (0x1UL << RCC_AHB2STPENR1_GPIOCSTPEN_Pos)     /*!< 0x00000004 */
#define RCC_AHB2STPENR1_GPIOCSTPEN          RCC_AHB2STPENR1_GPIOCSTPEN_Msk                /*!< IO port C Clock Enable in Stop Mode */
#define RCC_AHB2STPENR1_GPIODSTPEN_Pos      (3UL)
#define RCC_AHB2STPENR1_GPIODSTPEN_Msk      (0x1UL << RCC_AHB2STPENR1_GPIODSTPEN_Pos)     /*!< 0x00000008 */
#define RCC_AHB2STPENR1_GPIODSTPEN          RCC_AHB2STPENR1_GPIODSTPEN_Msk                /*!< IO port D Clock Enable in Stop Mode */
#define RCC_AHB2STPENR1_GPIOHSTPEN_Pos      (7UL)
#define RCC_AHB2STPENR1_GPIOHSTPEN_Msk      (0x1UL << RCC_AHB2STPENR1_GPIOHSTPEN_Pos)     /*!< 0x00000080 */
#define RCC_AHB2STPENR1_GPIOHSTPEN          RCC_AHB2STPENR1_GPIOHSTPEN_Msk                /*!< IO port H Clock Enable in Stop Mode */
#define RCC_AHB2STPENR1_DAC1STPEN_Pos       (11UL)
#define RCC_AHB2STPENR1_DAC1STPEN_Msk       (0x1UL << RCC_AHB2STPENR1_DAC1STPEN_Pos)      /*!< 0x00000800 */
#define RCC_AHB2STPENR1_DAC1STPEN           RCC_AHB2STPENR1_DAC1STPEN_Msk                 /*!< DAC1 Clock Enable in Stop Mode */
#define RCC_AHB2STPENR1_SRAM2STPEN_Pos      (30UL)
#define RCC_AHB2STPENR1_SRAM2STPEN_Msk      (0x1UL << RCC_AHB2STPENR1_SRAM2STPEN_Pos)     /*!< 0x40000000 */
#define RCC_AHB2STPENR1_SRAM2STPEN          RCC_AHB2STPENR1_SRAM2STPEN_Msk                /*!< SRAM2 Clock Enable in Stop Mode */

/********************  Bit definition for RCC_APB1STPENR1 register  **************/
#define RCC_APB1STPENR1_SPI2STPEN_Pos       (14UL)
#define RCC_APB1STPENR1_SPI2STPEN_Msk       (0x1UL << RCC_APB1STPENR1_SPI2STPEN_Pos)      /*!< 0x00004000 */
#define RCC_APB1STPENR1_SPI2STPEN           RCC_APB1STPENR1_SPI2STPEN_Msk                 /*!< SPI2 Clock Enable in Stop Mode */
#define RCC_APB1STPENR1_USART3STPEN_Pos     (18UL)
#define RCC_APB1STPENR1_USART3STPEN_Msk     (0x1UL << RCC_APB1STPENR1_USART3STPEN_Pos)    /*!< 0x00040000 */
#define RCC_APB1STPENR1_USART3STPEN         RCC_APB1STPENR1_USART3STPEN_Msk               /*!< USART3 Clock Enable in Stop Mode */
#define RCC_APB1STPENR1_UART4STPEN_Pos      (19UL)
#define RCC_APB1STPENR1_UART4STPEN_Msk      (0x1UL << RCC_APB1STPENR1_UART4STPEN_Pos)     /*!< 0x00080000 */
#define RCC_APB1STPENR1_UART4STPEN          RCC_APB1STPENR1_UART4STPEN_Msk                /*!< UART4 Clock Enable in Stop Mode */
#define RCC_APB1STPENR1_I2C1STPEN_Pos       (21UL)
#define RCC_APB1STPENR1_I2C1STPEN_Msk       (0x1UL << RCC_APB1STPENR1_I2C1STPEN_Pos)      /*!< 0x00200000 */
#define RCC_APB1STPENR1_I2C1STPEN           RCC_APB1STPENR1_I2C1STPEN_Msk                 /*!< I2C1 Clock Enable in Stop Mode */
#define RCC_APB1STPENR1_I3C1STPEN_Pos       (23UL)
#define RCC_APB1STPENR1_I3C1STPEN_Msk       (0x1UL << RCC_APB1STPENR1_I3C1STPEN_Pos)      /*!< 0x00800000 */
#define RCC_APB1STPENR1_I3C1STPEN           RCC_APB1STPENR1_I3C1STPEN_Msk                 /*!< I3C1 Clock Enable in Stop Mode  */
#define RCC_APB1STPENR1_OPAMPSTPEN_Pos      (28UL)
#define RCC_APB1STPENR1_OPAMPSTPEN_Msk      (0x1UL << RCC_APB1STPENR1_OPAMPSTPEN_Pos)     /*!< 0x100000000 */
#define RCC_APB1STPENR1_OPAMPSTPEN          RCC_APB1STPENR1_OPAMPSTPEN_Msk                /*!< OPAMP Clock Enable in Stop Mode */
#define RCC_APB1STPENR1_RTCAPBSTPEN_Pos     (30UL)
#define RCC_APB1STPENR1_RTCAPBSTPEN_Msk     (0x1UL << RCC_APB1STPENR1_RTCAPBSTPEN_Pos)    /*!< 0x400000000 */
#define RCC_APB1STPENR1_RTCAPBSTPEN         RCC_APB1STPENR1_RTCAPBSTPEN_Msk               /*!< RTCAPB Clock Enable in Stop Mode */

/********************  Bit definition for RCC_APB1STPENR2 register  **************/
#define RCC_APB1STPENR2_LPTIM2STPEN_Pos     (5UL)
#define RCC_APB1STPENR2_LPTIM2STPEN_Msk     (0x1UL << RCC_APB1STPENR2_LPTIM2STPEN_Pos)    /*!< 0x00000020 */
#define RCC_APB1STPENR2_LPTIM2STPEN         RCC_APB1STPENR2_LPTIM2STPEN_Msk               /*!< LPTIM2 Clock Enable in Stop Mode */

/********************  Bit definition for RCC_APB2STPENR register  **************/
#define RCC_APB2STPENR_SPI1STPEN_Pos        (12UL)
#define RCC_APB2STPENR_SPI1STPEN_Msk        (0x1UL << RCC_APB2STPENR_SPI1STPEN_Pos)       /*!< 0x00001000 */
#define RCC_APB2STPENR_SPI1STPEN            RCC_APB2STPENR_SPI1STPEN_Msk                  /*!< SPI1 Clock Enable in Stop Mode */
#define RCC_APB2STPENR_USART1STPEN_Pos      (14UL)
#define RCC_APB2STPENR_USART1STPEN_Msk      (0x1UL << RCC_APB2STPENR_USART1STPEN_Pos)     /*!< 0x00004000 */
#define RCC_APB2STPENR_USART1STPEN          RCC_APB2STPENR_USART1STPEN_Msk                /*!< USART1 Clock Enable in Stop Mode */
#define RCC_APB2STPENR_USB1STPEN_Pos        (24UL)
#define RCC_APB2STPENR_USB1STPEN_Msk        (0x1UL << RCC_APB2STPENR_USB1STPEN_Pos)       /*!< 0x01000000 */
#define RCC_APB2STPENR_USB1STPEN            RCC_APB2STPENR_USB1STPEN_Msk                  /*!< USB1 Clock Enable in Stop Mode */

/********************  Bit definition for RCC_APB3STPENR register  **************/
#define RCC_APB3STPENR_LPUART1STPEN_Pos     (6UL)
#define RCC_APB3STPENR_LPUART1STPEN_Msk     (0x1UL << RCC_APB3STPENR_LPUART1STPEN_Pos)   /*!< 0x00000040 */
#define RCC_APB3STPENR_LPUART1STPEN         RCC_APB3STPENR_LPUART1STPEN_Msk              /*!< LPUART1 Clock Enable in Stop Mode */
#define RCC_APB3STPENR_I2C3STPEN_Pos        (7UL)
#define RCC_APB3STPENR_I2C3STPEN_Msk        (0x1UL << RCC_APB3STPENR_I2C3STPEN_Pos)      /*!< 0x00000080 */
#define RCC_APB3STPENR_I2C3STPEN            RCC_APB3STPENR_I2C3STPEN_Msk                 /*!< I2C3 Clock Enable in Stop Mode */
#define RCC_APB3STPENR_LPTIM1STPEN_Pos      (11UL)
#define RCC_APB3STPENR_LPTIM1STPEN_Msk      (0x1UL << RCC_APB3STPENR_LPTIM1STPEN_Pos)    /*!< 0x00000800 */
#define RCC_APB3STPENR_LPTIM1STPEN          RCC_APB3STPENR_LPTIM1STPEN_Msk               /*!< LPTIM1 Clock Enable in Stop Mode */
#define RCC_APB3STPENR_LPTIM3STPEN_Pos      (12UL)
#define RCC_APB3STPENR_LPTIM3STPEN_Msk      (0x1UL << RCC_APB3STPENR_LPTIM3STPEN_Pos)    /*!< 0x00001000 */
#define RCC_APB3STPENR_LPTIM3STPEN          RCC_APB3STPENR_LPTIM3STPEN_Msk               /*!< LPTIM3 Clock Enable in Stop Mode */
#define RCC_APB3STPENR_LPTIM4STPEN_Pos      (13UL)
#define RCC_APB3STPENR_LPTIM4STPEN_Msk      (0x1UL << RCC_APB3STPENR_LPTIM4STPEN_Pos)    /*!< 0x00002000 */
#define RCC_APB3STPENR_LPTIM4STPEN          RCC_APB3STPENR_LPTIM4STPEN_Msk               /*!< LPTIM4 Clock Enable in Stop Mode */
#define RCC_APB3STPENR_COMPSTPEN_Pos        (15UL)
#define RCC_APB3STPENR_COMPSTPEN_Msk        (0x1UL << RCC_APB3STPENR_COMPSTPEN_Pos)      /*!< 0x00008000 */
#define RCC_APB3STPENR_COMPSTPEN            RCC_APB3STPENR_COMPSTPEN_Msk                 /*!< COMP Clock Enable in Stop Mode */

